{
    "Gemini": ["Curious: Gemini individuals are known for their curious and inquisitive nature. They are always eager to learn new things and explore the world around them.",
    "Adaptable: Gemini people are adaptable and can easily adjust to changing situations or environments. They are flexible and can think on their feet, making them good problem-solvers.",
    "Witty: Gemini individuals are known for their quick wit and sense of humor. They have a talent for making others laugh and can be quite entertaining.",
    "Intellectual: Gemini people are often intellectually curious and have a love of learning. They are interested in a wide range of subjects and are known for their intelligence and quick thinking.",
    "Sociable: Gemini individuals are social creatures and tend to have many friends. They are outgoing and enjoy meeting new people and experiencing new things.",
    "Superficial: Gemini people can sometimes be superficial, focusing too much on appearances or surface-level qualities rather than deeper aspects of a person or situation.",
    "Indecisive: Gemini individuals can sometimes have a hard time making decisions, as they can see multiple sides of an issue and may struggle to commit to one course of action."
    ],
    "Aries": ["Ambitious: Aries tend to be driven and ambitious individuals who are always looking for their next challenge.",
    "Courageous: Aries are known for their bravery and fearlessness, and they are not afraid to take risks or stand up for what they believe in.",
    "Independent: Aries value their independence and often prefer to work alone rather than in a group.",
    "Energetic: Aries have a lot of energy and enthusiasm, which can make them very passionate about their pursuits.",
    "Impulsive: Aries tend to act quickly and impulsively, which can sometimes lead to rash decisions or impulsive behavior.",
    "Competitive: Aries love a good challenge and are often very competitive, whether it's in sports, work, or other areas of their lives.",
    "Direct: Aries tend to be straightforward and honest, and they don't usually beat around the bush or sugarcoat their words.",
    "Personality: Aries are typically self-assured and confident, which can make them great leaders and motivators."
    ],
    "Pisces":["Pisces is a very intuitive sign and has a natural ability to pick up on the emotions and feelings of others.",
    "Compassionate: Pisces is a very empathetic and compassionate sign, always willing to lend a listening ear and offer support.",
    "Artistic: Pisces is often associated with creativity and a love for the arts. Many Pisces are drawn to music, poetry, and other forms of artistic expression.",
    "Dreamy: Pisces has a tendency to get lost in their own thoughts and daydreams. They may appear absent-minded at times, but are often just lost in their own world.",
    "Sensitive: Pisces is a very sensitive sign and can be easily hurt by criticism or harsh words. They may also take on the emotions of others, sometimes to their own detriment.",
    "Escapist: Pisces can sometimes have a tendency to avoid problems or difficult situations by retreatinginto their own fantasy world or engaging in unhealthy behaviors like substance abuse.",
    "Romantic: Pisces is a very romantic sign and values deep emotional connections with their partners.They are often very caring and nurturing in relationships.",
    "Overall, Pisces is a compassionate, artistic, and intuitive sign that values emotional connections and spirituality."
    ],
    "Aquarius":["Aquarius is the eleventh astrological sign of the zodiac, and individuals born between January 20 and February 18 are said to have Aquarius as their sun sign.",
    "Independent: Aquarius individuals may value their independence and may have a strong sense of self.They may be comfortable doing things on their own and may not feel the need to conform to societal norms.",
    "Progressive: Aquarius people tend to be forward-thinking and may have a desire to create positive change in the world. They may be drawn to social justice, humanitarian causes, or other efforts to make the world a better place.",
    "Intellectual: Aquarius individuals may have a strong intellect and a love of learning. They may be creative, innovative, and interested in exploring new ideas.",
    "Eccentric: Aquarius people may sometimes be seen as quirky or eccentric. They may have unique ideas or interests that set them apart from others.",
    "Friendly: Aquarius individuals can be quite friendly and may enjoy socializing with a wide range of people. They may be accepting of others, regardless of their background or beliefs.",
    "Rebellious: Aquarius individuals may sometimes be rebellious or contrarian. They may enjoy challenging authority or pushing back against societal norms and expectations.",
    "Unpredictable: Aquarius people may sometimes be unpredictable or inconsistent. They may change their minds frequently, or may have a hard time committing to a particular path or plan."
    ],
    "Cancer":["Cancer is the fourth sign of the zodiac, and individuals born between June 21 and July 22 are said to have Cancer as their sun sign. Here are some traits associated with Cancer:",
    "Nurturing: Cancer individuals are known for their nurturing and caring nature. They have a strong instinct to protect and care for those around them, particularly their family and loved ones.",
    "Emotional: Cancer people tend to be very in touch with their emotions and have a strong emotional intelligence. They are empathetic and compassionate, and they can provide a great deal of emotional support to those around them.",
    "Intuitive: Cancer individuals have a strong intuition and are often able to sense the emotions and needs of others without being told.",
    "Tenacious: Cancer people are very tenacious and have a strong sense of determination. They are willing to work hard to achieve their goals and are not easily deterred by obstacles or setbacks.",
    "Creative: Cancer individuals tend to be creative and imaginative, and they may have artistic talents or hobbies.",
    "Overly cautious: Cancer people tend to be quite cautious and may have a tendency to play it safe rather than taking risks. They may need to be encouraged to step out of their comfort zones and try new things.",
    "Moody: Cancer individuals can be quite moody and may experience intense emotional ups and downs. They can be easily affected by their environment or the moods of those around them."
    ],
    "Capricorn":["Capricorn is the tenth astrological sign of the zodiac, and individuals born between December 22 and January 19 are said to have Capricorn as their sun sign.",
    "Ambitious: Capricorn individuals are often highly ambitious and may have a strong desire to achieve success and recognition in their chosen field.",
    "Disciplined: Capricorn people tend to be disciplined and may have a strong work ethic. They may be willing to put in the time and effort necessary to achieve their goals.",
    "Practical: Capricorn individuals may have a practical and pragmatic approach to life. They may be good at finding solutions to practical problems or challenges.",
    "Responsible: Capricorn people can be quite responsible and reliable. They may be trusted to follow through on their commitments and take care of their obligations.",
    "Patient: Capricorn individuals may be patient and persistent. They may be willing to work towards their goals over a long period of time, even if progress is slow.",
    "Distant: Capricorn people may sometimes be seen as distant or aloof, and may have a hard time connecting emotionally with others.",
    "Pessimistic: Capricorn people may sometimes be pessimistic or cynical, and may have a tendency to focus on the negative aspects of a situation."
    ],
    "Leo":["Leo is the fifth astrological sign of the zodiac, and individuals born between July 23 and August 22 are said to have Leo as their sun sign.",
    "Confident: Leo individuals are often known for their confidence and self-assuredness. They have a strong sense of self and are not afraid to take the lead or stand up for what they believe in.",
    "Charismatic: Leo people tend to be very charismatic and have a natural ability to draw others to them. They may be outgoing, enthusiastic, and magnetic.",
    "Generous: Leo individuals are often very generous and may enjoy giving to others, whether it be through gifts, compliments, or acts of kindness.",
    "Creative: Leo people tend to have a strong creative side and may be drawn to artistic pursuits or hobbies.",
    "Loyal: Leo individuals are often very loyal to their friends and loved ones. They may go to great lengths to protect and defend those they care about.",
    "Possessive: Leo individuals may be possessive of their loved ones, belongings, or ideas. They may have a tendency to want to control or dominate in their relationships or partnerships.",
    "Impatient: Leo individuals can be quite impatient and may have a tendency to want things to happen quickly or on their own timeline."
    ],
    "Libra":["Libra is the seventh astrological sign of the zodiac, and individuals born between September 23 and October 22 are said to have Libra as their sun sign.",
    "Diplomatic: Libra individuals are often known for their ability to see both sides of a situation and find a compromise or solution that works for everyone involved.",
    "Charming: Libra people tend to be charming and charismatic, and may enjoy socializing and meeting new people.",
    "Fair-minded: Libra people tend to value fairness and equality. They may be motivated to fight for justice or defend the underdog.",
    "Harmonious: Libra individuals often strive to create harmony and balance in their surroundings. They may be drawn to aesthetics and may enjoy decorating or designing their environment.",
    "Romantic: Libra individuals may have a strong appreciation for beauty and may be drawn to romance and love. They may enjoy expressing their feelings through creative outlets such as art, music, or writing.",
    "Avoiding conflict: Libra people may have a strong aversion to conflict and may go to great lengths to avoid confrontation or disagreements.",
    "Superficial: Libra individuals may have a tendency to prioritize appearances or social status over deeper values or qualities."
    ],
    "Sagittarius":["Sagittarius is the ninth astrological sign of the zodiac, and individuals born between November 22 and December 21 are said to have Sagittarius as their sun sign.",
    "Adventurous: Sagittarius individuals are often known for their love of adventure and exploration. They may enjoy travel, trying new things, and taking risks.",
    "Optimistic: Sagittarius people tend to have a positive outlook on life and may be hopeful and enthusiastic about the future.",
    "Independent: Sagittarius individuals may value their independence and freedom, and may be comfortable doing things on their own.",
    "Honest: Sagittarius people can be quite straightforward and may value honesty and integrity. They may be known for speaking their mind.",
    "Intellectual: Sagittarius individuals may have a strong intellect and a love of learning. They may be drawn to philosophy, spirituality, or other fields that offer intellectual stimulation.",
    "Commitment-phobic: Sagittarius people may sometimes struggle with commitment, whether in relationships or other areas of life. They may be hesitant to settle down or make long-term plans.",
    "Overconfident: Sagittarius individuals can sometimes be overconfident or boastful. They may have a tendency to overestimate their abilities or underestimate the challenges they may face."
    ],
    "Scorpio":["Scorpio is the eighth astrological sign of the zodiac, and individuals born between October 23 and November 21 are said to have Scorpio as their sun sign.",
    "Passionate: Scorpio individuals are often passionate and intense, and may bring a strong sense of energy and enthusiasm to their pursuits.",
    "Resourceful: Scorpio people tend to be resourceful and may be able to find creative solutions to difficult problems or challenges.",
    "Loyal: Scorpio individuals may be fiercely loyal to their friends and loved ones. They may go to great lengths to protect and support those they care about.",
    "Ambitious: Scorpio people can be highly ambitious and driven. They may have a strong desire to achieve success and may be willing to work hard to reach their goals.",
    "Intuitive: Scorpio individuals may have a strong intuition or psychic ability, and may be able to pick up on subtle cues or energies.",
    "Secretive: Scorpio people can be quite secretive or private, and may be reluctant to share personal information or feelings with others.", 
    "Intense: Scorpio individuals may sometimes be seen as intimidating or overwhelming due to their intensity and passion."
    ],
    "Taurus":["Taureans are considered to be the anchor of the zodiac. Their fixed modality means that Bulls love their stability and find comfort in consistency.",
    "Patient and reliable: Taurus individuals are known for their patience and dependability. They can be counted on to follow through on their commitments and are unlikely to give up on a task or project easily.",
    "Loyal: Taurus people are deeply loyal to those they care about, whether it's friends, family, or a romantic partner. They value stability and consistency in their relationships.",
    "Practical: Taurus individuals are known for their practicality and down-to-earth approach to life. They tend to be grounded and sensible, and they often have a good head for business or financial matters.",
    "Determined: Once a Taurus sets their mind to something, they will work hard to achieve it. They are not easily deterred by obstacles or setbacks, and they have a strong sense of perseverance.",
    "Sensual: Taurus individuals are known for their love of physical pleasure, whether it's good food, fine wine, or a comfortable bed. They tend to have a strong appreciation for beauty and aesthetics.",
    "Patient: Taureans live life at a slower pace than most other people . What actually drives this is a deeply-held desire to ponder and consider their every move. They like to analyse… everything. And it’s this eternal deliberation which makes them so darned stubborn. They have already thought it all through and therefore are totally clear on and committed to where they stand.",
    "People born under the Taurus sign also value honesty above all else, so don't try to pull a fast one on them—they'll never forgive you if they find out you've deceived them."
    ],
    "Virgo":["Virgo is the sixth astrological sign of the zodiac, and individuals born between August 23 and September 22 are said to have Virgo as their sun sign.",
    "Detail-oriented: Virgo individuals are often known for their attention to detail and precision. They may be meticulous and careful in their work or other areas of their life.",
    "Analytical: Virgo people tend to be analytical and logical, and they may enjoy problem-solving or organizing information.",
    "Practical: Virgo individuals tend to be practical and may value efficiency and productivity. They may be good at finding ways to streamline tasks or systems.",
    "Reliable: Virgo people tend to be reliable and responsible. They may be seen as trustworthy and dependable by others.",
    "Loyal: Virgo individuals are often loyal to their friends and loved ones. They may go out of their way to support those they care about.",
    "Perfectionistic: Virgo individuals may have a tendency towards perfectionism, which can lead to unrealistic expectations or excessive worry about details.",
    "Worrying: Virgo individuals can be prone to worrying or overthinking. They may have a tendency to anticipate problems or catastrophize situations."
    ]
}